Repository: TruongVinhKiet/Vietnam-Healthy-Life
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Settings
vi: Cài đặt

source: Language
vi: Ngôn ngữ

source: Vietnamese
vi: Tiếng Việt

source: English
vi: Tiếng Anh

source: Notifications
vi: Thông báo

source: No notifications
vi: Không có thông báo

source: at
vi: lúc

# suggestionLoadError
source: Failed to load suggestions
vi: Lỗi tải gợi ý

# suggestionGenericError
source: Error: {error}
vi: Lỗi: {error}

# suggestionGenerateSuccess
source: Suggestions created!
vi: Tạo gợi ý thành công!

# suggestionGenerateError
source: Failed to create suggestions
vi: Lỗi tạo gợi ý

# suggestionAcceptSuccess
source: Suggestion accepted!
vi: Đã chấp nhận gợi ý!

# suggestionAcceptError
source: Failed to accept suggestion
vi: Lỗi chấp nhận gợi ý

# suggestionSwapSuccess
source: New suggestion swapped!
vi: Đã đổi gợi ý mới!

# suggestionSwapError
source: Failed to swap suggestion
vi: Lỗi đổi gợi ý

# suggestionGenerating
source: Generating...
vi: Đang tạo...

# suggestionCreateNew
source: Create new suggestion
vi: Tạo gợi ý mới

# suggestionEmptyTitle
source: No suggestions yet
vi: Chưa có gợi ý

# suggestionEmptyMessage
source: Tap "Create new suggestion" to generate meals for this day
vi: Nhấn nút "Tạo gợi ý mới" để tạo gợi ý bữa ăn cho ngày này

# suggestionEmptyAction
source: Create suggestion
vi: Tạo gợi ý

# suggestionCountLabel
source: {count} items
vi: {count} món

source: Tomorrow
vi: Ngày mai

source: Swap suggestion
vi: Đổi gợi ý

source: Processing...
vi: Đang xử lý...

source: Accept
vi: Chấp nhận

# acceptedNote
source: Accepted - please add this to your diary!
vi: Đã chấp nhận - Hãy thêm món này vào nhật ký!

# portionSize
source: {count} servings
vi: {count} phần

# mealLabel
source: Dish
vi: Món ăn

# drinkLabel
source: Drink
vi: Đồ uống

# chooseMealCountsTitle
source: Select meal counts
vi: Chọn số lượng món ăn

# chooseMealCountsSubtitle
source: Choose number of dishes and drinks per meal (Max 2 dishes/meal)
vi: Chọn số lượng món ăn và đồ uống cho mỗi bữa (Tối đa 2 món/bữa)

source: Cancel
vi: Hủy

source: Confirm
vi: Xác nhận

# mealField
source: Dish
vi: Món ăn

# drinkField
source: Drink
vi: Đồ uống

source: Take photo
vi: Chụp ảnh

source: Pick from gallery
vi: Chọn từ thư viện

source: Analyzing image...
vi: Đang phân tích ảnh...

# retakePhoto
source: Retake
vi: Chụp lại

# recognizeDish
source: Dish recognition
vi: Nhận diện món ăn

# saveDataError
source: Failed to save data: {error}
vi: Lỗi lưu dữ liệu: {error}

# defaultDishName
source: Dish
vi: Món ăn

# accuracy
source: Accuracy: {percent}%
vi: Độ chính xác: {percent}%

source: Nutrition composition
vi: Thành phần dinh dưỡng

source: Nutrient
vi: Chất dinh dưỡng

source: Amount
vi: Lượng

source: Reject
vi: Từ chối

source: Saving...
vi: Đang lưu...

# medicationStats
source: Medication statistics
vi: Thống kê uống thuốc

# days7
source: 7 days
vi: 7 ngày

# days14
source: 14 days
vi: 14 ngày

# days30
source: 30 days
vi: 30 ngày

source: No data
vi: Không có dữ liệu

# totalDose
source: Total doses
vi: Tổng số liều

source: Taken
vi: Đã uống

# onTime
source: On time (±1 hour)
vi: Uống đúng giờ (±1 giờ)

source: Late
vi: Uống trễ

source: Missed
vi: Quên uống

source: Adherence
vi: Tuân thủ

# onTimeShort
source: On time
vi: Đúng giờ

# loadNotificationsError
source: Failed to load notifications: {error}
vi: Lỗi khi tải thông báo: {error}

# noNotificationsShort
source: No notifications
vi: Không có thông báo

# errorSaveData
source: Save failed: {error}
vi: Lỗi lưu dữ liệu: {error}

source: Health warning
vi: Cảnh báo sức khỏe

# notSuitableForHealth
source: {item} is not suitable for your health condition. You should not eat this.
vi: {item} không phù hợp với tình trạng sức khỏe của bạn. Bạn không nên ăn món này.

# dishContainsRestrictedFood
source: This dish contains foods you should avoid based on your health condition
vi: Món này chứa thực phẩm cần tránh theo tình trạng sức khỏe của bạn

# usuallyEaten
source: Commonly eaten
vi: Món ăn thường dùng

# nutrientForWeight
source: Nutrition for {weight}g
vi: Dinh dưỡng cho {weight}g

source: Minerals
vi: Khoáng chất

source: Other
vi: Khác

source: Drug interaction warning
vi: Cảnh báo tương tác thuốc

# recentlyTookDrug
source: You just took medication and this food may interact:
vi: Bạn vừa uống thuốc và thực phẩm này có thể tương tác:

# drugNameFallback
source: Medication
vi: Thuốc

# interactionWithNutrient
source: Interacts with {nutrient}
vi: Có tương tác với {nutrient}

source: Nutrient: {name}
vi: Chất dinh dưỡng: {name}

# areYouSure
source: Are you sure you want to continue?
vi: Bạn có chắc muốn tiếp tục?

source: Continue anyway
vi: Vẫn tiếp tục

# cancelAction
source: Cancel
vi: Hủy

# fieldTooLong
source: {field} is too long, truncated to limit
vi: {field} quá dài, đã cắt xuống giới hạn

# fieldInvalidChars
source: {field} contains invalid characters
vi: {field} chứa ký tự không hợp lệ

# fieldInvalid
source: {field} is invalid
vi: {field} không hợp lệ

# fieldMaxInteger
source: {field} max {max} integer digits
vi: {field} tối đa {max} chữ số phần nguyên

# fieldMaxFraction
source: {field} max {max} fractional digits
vi: {field} tối đa {max} chữ số thập phân

# fieldMustBeNumber
source: {field} must be a number
vi: {field} phải là số

# fieldMinValue
source: {field} must be >= {min}
vi: {field} phải >= {min}

# fieldMaxValue
source: {field} must be <= {max}
vi: {field} phải <= {max}

source: Edit personal info
vi: Chỉnh sửa thông tin cá nhân

# basicInfo
source: Basic information
vi: Thông tin cơ bản

source: Change avatar
vi: Thay đổi ảnh đại diện

source: Full Name
vi: Họ và tên

source: Invalid email
vi: Email không hợp lệ

# ageLabel
source: Age
vi: Tuổi

# ageMustBeNumber
source: Age must be a number
vi: Tuổi phải là số

# ageRange
source: Age: 5-120
vi: Tuổi: 5-120

# genderLabel
source: Gender
vi: Giới tính

source: Female
vi: Nữ

# otherGender
source: Other
vi: Khác

# heightLabel
source: Height (cm)
vi: Chiều cao (cm)

# heightLabelShort
source: Height
vi: Chiều cao

# weightLabel
source: Weight (kg)
vi: Cân nặng (kg)

# weightLabelShort
source: Weight
vi: Cân nặng

source: Lifestyle & Preferences
vi: Lối sống & Sở thích

# activityLevelLabel
source: Activity level
vi: Mức độ vận động

# activitySedentary
source: Sedentary
vi: Ít vận động

# activityLight
source: Lightly active
vi: Vận động nhẹ

# activityModerate
source: Moderately active
vi: Vừa phải

# activityActive
source: Active
vi: Rất năng động

# activityVeryActive
source: Very active
vi: Cực kỳ năng động

# dietTypeLabel
source: Diet type
vi: Kiểu ăn

# dietMediterranean
source: Mediterranean
vi: Địa trung hải

# dietCustom
source: Custom
vi: Tự chọn

source: Food allergy
vi: Dị ứng thực phẩm

source: Health Goal
vi: Mục tiêu sức khỏe

source: Lose Weight
vi: Giảm cân

source: Maintain Weight
vi: Duy trì cân nặng

source: Gain Weight
vi: Tăng cân

source: Interface
vi: Giao diện

source: Interface Mode
vi: Chế độ giao diện

source: Automatic
vi: Tự động

source: Light
vi: Sáng

source: Dark
vi: Tối

source: Seasonal Interface
vi: Giao diện theo mùa

# autoChangeByMonth
source: Automatically change by month
vi: Tự động thay đổi theo tháng

source: Season Mode
vi: Chế độ mùa

source: Automatic (by month)
vi: Tự động (theo tháng)

source: Manual
vi: Thủ công

source: Off
vi: Tắt

source: Falling Leaves
vi: Hiệu ứng lá rụng

# fallingLeavesEffect
source: Falling leaves autumn effect
vi: Hiệu ứng lá rơi mùa thu

source: Weather
vi: Thời tiết

source: Weather City
vi: Thành phố thời tiết

source: Wind Direction
vi: Hướng gió

# windNorth
source: North (N)
vi: Bắc (N)

# windNorthEast
source: North East (NE)
vi: Đông Bắc (NE)

# windEast
source: East (E)
vi: Đông (E)

# windSouthEast
source: South East (SE)
vi: Đông Nam (SE)

# windSouth
source: South (S)
vi: Nam (S)

# windSouthWest
source: South West (SW)
vi: Tây Nam (SW)

# windWest
source: West (W)
vi: Tây (W)

# windNorthWest
source: North West (NW)
vi: Tây Bắc (NW)

# weatherAngle
source: Angle: {degree}°
vi: Góc: {degree}°

source: Background
vi: Nền

source: Background Image
vi: Hình nền

source: Enable Background Image
vi: Bật hình nền

source: Background Image URL
vi: URL hình nền

# applyBackgroundImageSubtitle
source: Apply the background image URL you enter
vi: Áp dụng URL ảnh nền bạn nhập

# weatherCityHint
source: e.g., Ho Chi Minh City, Ca Mau...
vi: TP HCM, Cà Mau...

source: Effect Intensity
vi: Cường độ hiệu ứng

source: Low
vi: Thấp

source: Medium
vi: Trung bình

source: High
vi: Cao

source: Save
vi: Lưu

source: Home
vi: Trang chủ

source: Health
vi: Sức khỏe

source: Statistics
vi: Thống kê

source: Account
vi: Tài khoản

source: Dietary Fiber
vi: Chất xơ

source: Fat
vi: Chất béo

source: Total Fiber
vi: Tổng chất xơ

# ofDailyGoal
source: of daily goal {goal}
vi: của mục tiêu hàng ngày {goal}

source: Done
vi: Hoàn thành

source: Goal not set
vi: Chưa đặt mục tiêu

source: Protein
vi: Chất đạm

source: Carbs
vi: Đường

source: Today!
vi: Hôm nay!

source: Last drink
vi: Lần uống cuối

source: No recent drink
vi: Không có nước uống gần đây

source: Yesterday
vi: Hôm qua

source: This Week
vi: Tuần này

source: This Month
vi: Tháng này

source: Add Meal
vi: Thêm bữa ăn

source: Breakfast
vi: Sáng

source: Lunch
vi: Trưa

source: Dinner
vi: Tối

source: Snack
vi: Xế

source: Search
vi: Tìm kiếm

source: No results
vi: Không tìm thấy kết quả

source: Loading...
vi: Đang tải...

source: Error
vi: Lỗi

source: Retry
vi: Thử lại

source: Login
vi: Đăng nhập

source: Register
vi: Đăng ký

source: Password
vi: Mật khẩu

source: Confirm Password
vi: Xác nhận mật khẩu

source: Forgot Password?
vi: Quên mật khẩu?

source: Name
vi: Tên

source: Age
vi: Tuổi

source: Gender
vi: Giới tính

source: Male
vi: Nam

source: Weight
vi: Cân nặng

source: Height
vi: Chiều cao

# activityLevel
source: Activity Level: {level}
vi: Mức độ: {level}

source: Goal
vi: Mục tiêu

source: Vitamins
vi: Vitamin

source: Amino Acids
vi: Axit amin

source: Fibers
vi: Chất xơ

source: Fats
vi: Chất béo

source: Information
vi: Thông tin

source: Nutrition Overview
vi: Tổng quan dinh dưỡng

source: Code
vi: Mã

source: Group
vi: Nhóm

source: Unit
vi: Đơn vị

source: Personal Recommendation
vi: Khuyến nghị cá nhân

source: Benefits
vi: Lợi ích

source: Description:
vi: Mô tả:

source: Foods
vi: Thực phẩm

source: Contraindications
vi: Chống chỉ định

source: Recommended
vi: Khuyến nghị

source: Consumed
vi: Đã tiêu thụ

source: Remaining
vi: Còn lại

source: left
vi: còn lại

source: Customize meal distribution
vi: Tùy chỉnh phân bổ bữa ăn

source: Percentages must sum to 100
vi: Tổng phần trăm phải bằng 100

# timeFormatMustBeHHmm
source: Time format must be HH:mm (e.g., 07:00)
vi: Định dạng thời gian phải là HH:mm (ví dụ: 07:00)

source: Percentage
vi: Phần trăm

source: Time (UTC+7)
vi: Thời gian (UTC+7)

source: Record
vi: Ghi nhận

source: Delete Drink
vi: Xóa đồ uống

# confirmDeleteDrink
source: Are you sure you want to delete this drink from your library?
vi: Bạn có chắc muốn xóa đồ uống này khỏi thư viện của bạn?

source: Delete
vi: Xóa

source: Cannot delete drink
vi: Không thể xóa đồ uống

source: Drink Detail
vi: Chi tiết nước uống

source: Drink not found
vi: Không tìm thấy đồ uống

# noIngredientInfo
source: No ingredient information
vi: Chưa có thông tin nguyên liệu

# quickEntry
source: Quick Entry (ml or L)
vi: Nhập nhanh (ml hoặc L)

source: Example: 250 or 0.3L
vi: Ví dụ: 250 hoặc 0.3L

# pleaseEnterValidWaterAmount
source: Please enter a valid water amount
vi: Vui lòng nhập lượng nước hợp lệ

# recordButton
source: Record
vi: Ghi

source: Settings saved
vi: Cài đặt đã được lưu

source: Enable weather update first
vi: Bật cập nhật thời tiết trước

source: Drink deleted
vi: Đã xóa đồ uống

source: Add Drink
vi: Thêm đồ uống

source: Edit
vi: Chỉnh sửa

source: Add
vi: Thêm

source: Name cannot be empty
vi: Tên không được để trống

source: Show to all users
vi: Hiển thị cho tất cả người dùng

source: No Sugar
vi: Không đường

source: Select Ingredient
vi: Chọn nguyên liệu

# enterKeywordToSearchFood
source: Enter keyword to search for food
vi: Nhập từ khóa để tìm kiếm thực phẩm

source: Create Drink
vi: Tạo đồ uống

source: No ingredients yet
vi: Chưa có nguyên liệu

source: Save Drink
vi: Lưu đồ uống

source: Manage Drinks
vi: Quản lý đồ uống

# confirmDeleteDrinkQuestion
source: Are you sure you want to delete this drink?
vi: Bạn có chắc muốn xóa đồ uống này?

source: Delete failed
vi: Xóa thất bại

source: Manage Foods
vi: Quản lý thực phẩm

source: Add Food
vi: Thêm thực phẩm

source: Page
vi: Trang

# noNutritionInfo
source: No nutrition information
vi: Chưa có thông tin dinh dưỡng

source: Confirm Delete
vi: Xác nhận xóa

# confirmDeleteFood
source: Are you sure you want to delete food "{foodName}"?
vi: Bạn có chắc muốn xóa thực phẩm "{foodName}"?

source: Food deleted successfully
vi: Xóa thực phẩm thành công

source: Cannot connect to server
vi: Không thể kết nối máy chủ

# errorLoadingList
source: Error loading list: {error}
vi: Lỗi tải danh sách: {error}

source: No drink recipes
vi: Chưa có công thức nước uống

# pleaseSelectDrink
source: Please select a drink to continue.
vi: Hãy chọn một đồ uống để tiếp tục.

# drinksNotFound
source: No drinks found
vi: Không tìm thấy đồ uống

source: Please add at least one ingredient
vi: Vui lòng thêm ít nhất một nguyên liệu

source: Recipes
vi: Công thức nấu ăn

source: Meal Templates
vi: Mẫu bữa ăn

source: Cannot load statistics
vi: Không thể tải thống kê

source: Manage Health Conditions
vi: Quản lý tình trạng sức khỏe

source: No diseases in system
vi: Chưa có bệnh nào trong hệ thống

# errorLoadingListColon
source: Error loading list
vi: Lỗi khi tải danh sách

source: Update according to weather
vi: Cập nhật theo thời tiết

source: Change interface by city
vi: Thay đổi giao diện theo thành phố

source: Weather effects
vi: Hiệu ứng theo thời tiết

source: Rain, snow, fog...
vi: Mưa, tuyết, sương mù...

# effectIntensityTitle
source: Effect Intensity
vi: Cường độ hiệu ứng

# windDirectionTitle
source: Wind Direction
vi: Hướng gió

source: Use custom background image
vi: Sử dụng ảnh nền tùy chỉnh

source: Preview background
vi: Xem trước ảnh nền

source: No image
vi: Không có ảnh

source: Drink created
vi: Đồ uống đã được tạo

source: Failed
vi: Thất bại

source: Ingredient
vi: Nguyên Liệu

# errorColon
source: Error
vi: Lỗi

source: Add Disease
vi: Thêm bệnh

# confirmDeleteDisease
source: Are you sure you want to delete disease "{diseaseName}"?
vi: Bạn có chắc muốn xóa bệnh "{diseaseName}"?

source: Disease deleted successfully
vi: Đã xóa bệnh thành công

source: No adjustments
vi: Chưa có điều chỉnh

source: No avoid list
vi: Chưa có danh sách cần tránh

source: Disease updated successfully
vi: Đã cập nhật bệnh thành công

source: Disease added successfully
vi: Đã thêm bệnh mới thành công

source: Weather updated
vi: Đã cập nhật thời tiết

source: Medication marked
vi: Đã đánh dấu uống thuốc

source: Edit Profile
vi: Chỉnh sửa hồ sơ

source: Recipe deleted
vi: Đã xóa công thức

# recipeDeleteError
source: Error deleting recipe
vi: Lỗi xóa công thức

source: Recipe added to meal
vi: Đã thêm công thức vào bữa ăn

# recipeAddToMealError
source: Error adding to meal
vi: Lỗi thêm vào bữa ăn

# recipeLoadError
source: Error loading recipes
vi: Lỗi tải công thức

# recipeLoadDetailError
source: Error loading details
vi: Lỗi tải chi tiết

source: Create first recipe
vi: Tạo công thức đầu tiên

source: Add to Meal
vi: Thêm vào bữa ăn

source: Delete Recipe
vi: Xóa công thức

# confirmDeleteRecipe
source: Are you sure you want to delete this recipe?
vi: Bạn có chắc muốn xóa công thức này?

# pleaseLoginToUseChat
source: Please login to use chat feature
vi: Vui lòng đăng nhập để sử dụng tính năng chat

# errorLoadingMessages
source: Error loading messages: {error}
vi: Lỗi tải tin nhắn: {error}

source: Error sending message
vi: Lỗi gửi tin nhắn

# errorAnalyzingImage
source: Error analyzing image. Please try again.
vi: Lỗi phân tích ảnh. Vui lòng thử lại.

source: Error sending image
vi: Lỗi gửi ảnh

source: Error processing
vi: Lỗi xử lý

source: Body Measurement
vi: Đo lường cơ thể

source: Mediterranean Diet
vi: Chế độ ăn Địa Trung Hải

source: Meals Today
vi: Bữa ăn hôm nay

source: Water
vi: Nước

source: Details
vi: Chi tiết

source: Customize
vi: Tùy chỉnh

source: Calcium
vi: Canxi

source: Fiber
vi: Chất xơ

source: Camera Nutrition Scanner
vi: Máy quét dinh dưỡng bằng camera

source: Coming Soon
vi: Sắp ra mắt

source: Failed to save
vi: Lưu thất bại

source: Network
vi: Mạng

source: Eaten
vi: Đã ăn

source: Burned
vi: Đã đốt

source: Kcal left
vi: Kcal còn lại

source: Top minerals
vi: Khoáng chất hàng đầu

source: Top vitamins
vi: Vitamin hàng đầu

# tapDetailsToSeeFullMineralsTable
source: Tap Details to see full minerals table and recommended daily amounts.
vi: Nhấn Chi tiết để xem bảng khoáng chất đầy đủ và lượng khuyến nghị hàng ngày.

# tapDetailsToSeeFullVitaminTable
source: Tap Details to see full vitamin table and recommended daily amounts.
vi: Nhấn Chi tiết để xem bảng vitamin đầy đủ và lượng khuyến nghị hàng ngày.

# tapDetailsToSeeFullAminoAcidTable
source: Tap Details to see full amino acid table and recommended amounts.
vi: Nhấn Chi tiết để xem bảng axit amin đầy đủ và lượng khuyến nghị.

source: Cooking Recipes
vi: Công Thức Nấu Ăn

source: Explore Vietnamese dishes
vi: Khám phá món ăn Việt Nam

source: View all
vi: Xem tất cả

source: Drink Recipes
vi: Công Thức Nước Uống

# customizeVolume
source: Self-made, customizable volume
vi: Tự pha chế, tùy chỉnh thể tích

source: Explore now
vi: Khám phá ngay

source: Discover
vi: Khám phá

source: Height (cm)
vi: Chiều cao (cm)

source: Weight (kg)
vi: Cân nặng (kg)

# activityFactor
source: Activity Factor (e.g. 1.2)
vi: Hệ số vận động (ví dụ 1.2)

source: Diet Type
vi: Kiểu ăn

# allergies
source: Allergies (select):
vi: Dị ứng (chọn):

# profileUpdateSuccess
source: Profile updated successfully
vi: Cập nhật hồ sơ thành công

source: No response from server
vi: Không nhận được phản hồi từ server

source: Record Water Intake
vi: Ghi nhận lượng nước

# selectDrinkToRecord
source: Select a drink to record
vi: Chọn đồ uống để ghi nhận

source: No drink recipes yet
vi: Chưa có công thức nước uống

# pleaseSelectDrinkToContinue
source: Please select a drink to continue.
vi: Hãy chọn một đồ uống để tiếp tục.

source: Reset
vi: Đặt lại

source: Logout
vi: Đăng xuất

source: Personal Information
vi: Thông tin cá nhân

source: Recommended Nutritional Needs
vi: Nhu cầu dinh dưỡng khuyến nghị

source: Security
vi: Bảo mật

source: Help
vi: Trợ giúp

source: About
vi: Giới thiệu

source: Not logged in
vi: Chưa đăng nhập

source: User
vi: Người dùng

source: Invalid data
vi: Dữ liệu không hợp lệ

source: Dish Detail
vi: Chi tiết món ăn

source: Dish not found
vi: Không tìm thấy món ăn

source: Create Dish
vi: Tạo món ăn

source: Please enter dish name
vi: Vui lòng nhập tên món ăn

source: Dish created successfully!
vi: Tạo món ăn thành công!

source: Continue Treatment
vi: Tiếp tục điều trị

source: Recovered
vi: Đã khỏi

# confirmContinueTreatment
source: Do you want to continue treatment for "{conditionName}"?
vi: Bạn muốn tiếp tục điều trị cho "{conditionName}"?

source: Treatment extended
vi: Đã gia hạn điều trị

# confirmRecovered
source: Have you recovered from "{conditionName}"?
vi: Bạn đã khỏi bệnh "{conditionName}"?

# congratulationsRecovered
source: Congratulations on your recovery! 🎉
vi: Chúc mừng bạn đã khỏi bệnh! 🎉

# cannotIdentifyConversation
source: Cannot identify this conversation
vi: Không xác định được cuộc hội thoại này

# noMessagesInConversation
source: No messages in this conversation
vi: Chưa có tin nhắn nào trong hội thoại này

# errorLoadingNotifications
source: Error loading notifications: {error}
vi: Lỗi khi tải thông báo: {error}

source: All marked as read
vi: Đã đánh dấu tất cả đã đọc

# cannotTakePhoto
source: Cannot take photo: {error}
vi: Không thể chụp ảnh: {error}

# cannotSelectImage
source: Cannot select image: {error}
vi: Không thể chọn ảnh: {error}

# cannotRecognizeFood
source: Cannot recognize food in image. Please try again with a clearer food image.
vi: Không nhận diện được thực phẩm trong ảnh. Vui lòng thử lại với ảnh món ăn rõ ràng hơn.

# errorConnectingToAI
source: Error connecting to AI: {error}
vi: Lỗi kết nối đến AI: {error}

# savedNutritionInfo
source: ✓ Saved nutrition info for {foodName}
vi: ✓ Đã lưu thông tin dinh dưỡng của {foodName}

# errorSavingData
source: Error saving data: {error}
vi: Lỗi lưu dữ liệu: {error}

# cannotLoadFoodInfo
source: Cannot load food information
vi: Không thể tải thông tin thực phẩm

source: Please select food or dish
vi: Vui lòng chọn thực phẩm hoặc món ăn

# pleaseEnterValidAmount
source: Please enter a valid amount
vi: Vui lòng nhập khối lượng hợp lệ

source: Added to meal successfully
vi: Đã thêm vào bữa ăn thành công

# errorLoadingDiseaseList
source: Error loading disease list: {error}
vi: Lỗi khi tải danh sách bệnh: {error}

# alreadyHaveDisease
source: You already have "{diseaseName}", cannot add again
vi: Bạn đang mắc bệnh "{diseaseName}" rồi, không thể thêm lại

# pleaseSelectStartDate
source: Please select treatment start date
vi: Vui lòng chọn ngày bắt đầu điều trị

source: Please select at least one medication time
vi: Vui lòng chọn ít nhất một giờ uống thuốc

# diseaseAdded
source: Added "{diseaseName}"
vi: Đã thêm "{diseaseName}"

source: Not determined
vi: Chưa xác định

source: No measurements
vi: Chưa có số đo

source: Increase resistance
vi: Tăng sức đề kháng

source: Strong bones
vi: Xương chắc khỏe

source: Good digestion
vi: Tiêu hóa tốt

source: Cardiovascular health
vi: Sức khỏe tim mạch

source: No meal data
vi: Chưa có dữ liệu bữa ăn

# searchDish
source: Search dish (e.g.: Pho, Rice)...
vi: Tìm món ăn (vd: Phở, Cơm)...

# searchIngredient
source: Search ingredient (e.g.: Beef, Vegetables)...
vi: Tìm nguyên liệu (vd: Thịt bò, Rau)...

source: Quick Add
vi: Thêm nhanh

source: Feature coming soon!
vi: Tính năng sẽ được cập nhật sớm!

source: Dish
vi: Món Ăn

# unreadCount
source: {count} unread
vi: {count} chưa đọc

source: Notification Detail
vi: Chi tiết thông báo

source: Select Health Condition
vi: Chọn tình trạng sức khỏe

source: Normal
vi: Bình thường

source: Underweight
vi: Gầy

source: Overweight
vi: Thừa cân

source: Obese
vi: Béo phì

source: Severely Underweight
vi: Thiếu cân nặng

source: Slightly Overweight
vi: Hơi thừa

source: Perfect
vi: Hoàn hảo

source: Good
vi: Tốt

source: Need Attention
vi: Cần chú ý

source: Need Improvement
vi: Cần cải thiện

# foodRestrictedByHealthCondition
source: {foodName} cannot be added due to your health condition
vi: {foodName} không được thêm do tình trạng sức khỏe

source: Delete Dish
vi: Xóa món ăn

# confirmDeleteDish
source: Are you sure you want to delete "{dishName}"?
vi: Bạn có chắc muốn xóa "{dishName}"?

# dishDeleted
source: Deleted "{dishName}"
vi: Đã xóa "{dishName}"

# cannotDeleteDish
source: Cannot delete dish ({errorMsg})
vi: Không thể xóa món ăn ({errorMsg})

source: Weight (g)
vi: Khối lượng (g)

source: Notes
vi: Ghi chú

source: Close
vi: Đóng

source: Enter food name...
vi: Nhập tên thực phẩm...

# enterKeywordToSearch
source: Enter keyword to search for food
vi: Nhập từ khóa để tìm kiếm thực phẩm

source: Name (English)
vi: Tên (English)

# nameVietnamese
source: Vietnamese Name
vi: Tên tiếng Việt

source: Category
vi: Danh mục

source: Base liquid / notes
vi: Base liquid / ghi chú

source: Default volume (ml)
vi: Thể tích mặc định (ml)

source: Ingredients
vi: Nguyên liệu

source: No ingredients
vi: Chưa có nguyên liệu nào

source: Search and add ingredients below
vi: Tìm kiếm và thêm nguyên liệu bên dưới

source: Your Health Condition
vi: Tình trạng sức khỏe của bạn

source: In Treatment
vi: Đang điều trị

source: Completed
vi: Hoàn thành
