Repository: TruongVinhKiet/Vietnam-Healthy-Life
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Medication Schedule
vi: Lịch uống thuốc

# todayDate
source: Today, {day}/{month}/{year}
vi: Hôm nay, {day}/{month}/{year}

source: Morning
vi: Buổi sáng

source: Afternoon
vi: Buổi trưa

source: Evening
vi: Buổi tối

source: Medication
vi: Thuốc

source: Next Appointment
vi: Ngày tới khám

source: Past
vi: Đã qua

# daysLeft
source: {days} days left
vi: {days} ngày nữa

source: Select new end date
vi: Chọn ngày kết thúc mới

source: Add New Appointment
vi: Thêm lịch hẹn mới

source: Title
vi: Tiêu đề

source: Start
vi: Bắt đầu

source: End
vi: Kết thúc

# passwordMismatch
source: Passwords do not match
vi: Mật khẩu không khớp

source: Registration failed
vi: Đăng ký thất bại

source: Required
vi: Bắt buộc

source: Invalid age
vi: Tuổi không hợp lệ

source: Select gender
vi: Chọn giới tính

source: Invalid
vi: Không hợp lệ

# passwordMinLength
source: Password must be at least 6 characters
vi: Mật khẩu >= 6 ký tự

source: Currently have this condition
vi: Đang mắc bệnh này

source: Treatment Info
vi: Thông tin điều trị

source: Treatment Start Date *
vi: Ngày bắt đầu điều trị *

source: Treatment End Date (Optional)
vi: Ngày kết thúc điều trị (Tùy chọn)

source: Select date
vi: Chọn ngày

source: Select Time
vi: Chọn giờ

source: Confirm Add
vi: Xác nhận thêm

source: Nutritional Notifications
vi: Thông báo dinh dưỡng

source: Mark All as Read
vi: Đánh dấu tất cả đã đọc

source: Refresh
vi: Làm mới

source: Notification
vi: Thông báo

source: Today Progress
vi: Tiến độ hôm nay

source: Current
vi: Hiện tại

source: Target
vi: Mục tiêu

source: Just now
vi: Vừa xong

# minutesAgo
source: {minutes} minutes ago
vi: {minutes} phút trước

# hoursAgo
source: {hours} hours ago
vi: {hours} giờ trước

# daysAgo
source: {days} days ago
vi: {days} ngày trước

source: Search disease...
vi: Tìm kiếm bệnh...

source: Causes:
vi: Nguyên nhân:

source: Cannot add disease
vi: Không thể thêm bệnh

# notLoggedInNoToken
source: Not logged in - token not found
vi: Chưa đăng nhập - không tìm thấy token

source: Water intake statistics by hour
vi: Thống kê nước uống theo giờ

source: No water intake recorded for today.
vi: Chưa có nước uống được ghi nhận cho ngày này.

source: No data for today
vi: Chưa có dữ liệu cho hôm nay

source: Please record your meals to see detailed statistics.
vi: Hãy ghi lại bữa ăn của bạn để xem thống kê chi tiết.

source: No detailed records for today.
vi: Chưa có ghi nhận chi tiết cho ngày này.

source: No data for this date
vi: Chưa có dữ liệu cho ngày này

source: Meal history for today
vi: Lịch sử bữa ăn trong ngày

source: Top nutrients
vi: Chất dinh dưỡng nổi bật

source: Dishes eaten
vi: Các món đã ăn

# moreDishes
source: +{count} more dishes
vi: +{count} món khác

source: Time unknown
vi: Chưa rõ giờ

# foodUnknown
source: Unknown food
vi: Món ăn không rõ

source: View overview
vi: Xem tổng quan

source: View details by date
vi: Xem chi tiết theo ngày

source: January
vi: Tháng 1

source: February
vi: Tháng 2

source: March
vi: Tháng 3

source: April
vi: Tháng 4

source: May
vi: Tháng 5

source: June
vi: Tháng 6

source: July
vi: Tháng 7

source: August
vi: Tháng 8

source: September
vi: Tháng 9

source: October
vi: Tháng 10

source: November
vi: Tháng 11

source: December
vi: Tháng 12

# sunday
source: Sun
vi: CN

# monday
source: Mon
vi: T2

# tuesday
source: Tue
vi: T3

# wednesday
source: Wed
vi: T4

# thursday
source: Thu
vi: T5

# friday
source: Fri
vi: T6

# saturday
source: Sat
vi: T7

# dishesToday
source: {count} dishes today
vi: {count} món hôm nay

# noMealRecorded
source: No meal recorded yet
vi: Chưa ghi nhận món ăn

# breakfastShort
source: Breakfast
vi: Sáng

# lunchShort
source: Lunch
vi: Trưa

# snackShort
source: Snack
vi: Xế

# dinnerShort
source: Dinner
vi: Tối
